# 状态码与提示信息的的封装
status_msg = {
    200:'登入成功',
    1000:'数据不完整',
    1001:'昵称不合法',
    1002:'密码不合法',
    1003:'俩次密码不一致',
    1004:'手机号不合法',
    1005:'邮箱不合法',
    1006:'请登入后使用',
    1007:'token不可使用',
    1008:'修改用户错误',
    1009:'删除错误',
    1010:'修改的角色不存在',
    1011:'没有此权限可删除',
    1012:'没有此数据',
    1013:'没有上传文件',
    1014:'文件格式不符合规范',
    1015:'用户名或密码错误',
    2000:'异常错误',
}

# 得到状态码中包含的信息
def to_get_status(status=200, data=None, msg=None):
    return {
        'status': status,
        'data': data,
        'msg' : msg if msg else status_msg.get(status)
    }


if __name__ == '__main__':
    p = to_get_status()
    print(p)